#+title: Nonlinear Rigid Block Normal-Mode Simulator (nb_sim)
#+EXPORT_FILE_NAME: index.html
#+setupfile: docs/setup-rto.org

* Introduction

This package provides an implementation of nonlinear normal mode analysis
based on rigid blocks for macromolecular systems — including proteins, complexes, and large assemblies.

It implements the NOLB method from Hoffmann & Grudinin (2017), using sparse matrix algebra and GPU-accelerated extrapolation.

* Install

~nb_sim~ installs in the usual Python way. Use of ~pip~ and a Python virtual environment is recommended.

#+begin_example
python3 -m venv venv
source venv/bin/activate
git clone https://github.com/rennney/NB_Sim.git
cd nb_sim
pip install -e .
#+end_example

* Usage

The ~nb_sim~ command-line interface provides online help:

#+begin_src shell :exports both :results output code :wrap example
nb_sim
#+end_src

#+RESULTS:
#+begin_example
Usage: nb_sim [OPTIONS] COMMAND [ARGS]...

  NMSim command line interface

Options:
  -s, --store PATH     File for primary data storage (input/output)
  -o, --outstore PATH  File for output (primary only input)
  --help               Show this message and exit.

Commands:
  fit-modes                Fit coefficients for initial RTB modes with
                           LBFGS...

  run-simulator            Run Simulation
  run-simulator-multimode  Run Simulation With Combined Modes
  run-test                 Run Small Test
#+end_example

To run a deformation using RTB-based normal modes:

#+begin_example
nb_sim run-simulator -i 2ch7.pdb -n 10 -a 18.0 -m 1  -f 6
#+end_example

This will:
- Compute the 10 slowest normal modes,
- Apply nonlinear deformation with amplitude 18.0,
- Perform deformation along normal mode 1,
- Save 6 deformed structures in range [-amplitude,amplitude] to ~2ch7.deformed.pdb~,
- Launch ~PyMOL~ to visualize both structures.

* References

- Hoffmann & Grudinin, *J. Chem. Theory Comput.* (2017), [[https://doi.org/10.1021/acs.jctc.7b00197][DOI: 10.1021/acs.jctc.7b00197]]
- Original C++ implementation: https://team.inria.fr/nano-d/software/nolb-normal-modes/
